Exercícios de manipulação de dados - Parte 1

Neste Jupyter notebook você irá resolver uma exercícios utilizando a linguagem Python e a biblioteca Pandas.

Todos os datasets utilizados nos exercícios estão salvos na pasta datasets.

Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

In [ ]:
import pandas as pd
from datetime import datetime


Passo 1. Importando os dados

Carregue os dados salvos no arquivo datasets/users_dataset.csv.

Esse arquivo possui um conjunto de dados de trabalhadores com 5 colunas separadas pelo símbolo "|" (pipe) e 943 linhas.

Dica: não se esqueça do argumento sep quando importar os dados.

In [ ]:
url = 'https://raw.githubusercontent.com/awarischool/data-manipulation-exercises/master/datasets/users_dataset.csv'
df = pd.read_csv(url,sep='|')

Passo 2. Mostre as 15 primeiras linhas do dataset.

Dica: use a função head do DataFrame

In [ ]:
df.head(15)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301

Passo 3. Mostre as 10 últimas linhas

In [ ]:
df.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841


Passo 4. Qual o número de linhas e colunas do DataFrame?

In [ ]:
print(f' O DataFrame possui {df.shape[0]} linhas e {df.shape[1]} colunas.')

 O DataFrame possui 943 linhas e 5 colunas.

Passo 5. Mostre o nome de todas as colunas.

In [ ]:
for index,col in enumerate(df.columns):
  print(f'a {index+1}ª coluna se chama {col}.')

a 1ª coluna se chama user_id.
a 2ª coluna se chama age.
a 3ª coluna se chama gender.
a 4ª coluna se chama occupation.
a 5ª coluna se chama zip_code.


Passo 6. Qual o tipo de dado de cada coluna?

In [ ]:
df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

Passo 7. Mostre os dados da coluna occupation.

In [ ]:
df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)


Passo 8. Quantas ocupações diferentes existem neste dataset?

In [ ]:
print(f"Existem {df['occupation'].nunique()} ocupações diferentes.")

Existem 21 ocupações diferentes.


Passo 9. Qual a ocupação mais frequente?

In [ ]:
df.groupby('occupation').agg({'user_id': 'nunique'}).reset_index().sort_values('user_id', ascending=False).head(1)

   occupation  user_id
18    student      196


Passo 10. Qual a idade média dos usuários?

In [ ]:
print(f"idade média dos usuários = {round(df['age'].mean(),2)}")

idade média dos usuários = 34.05


Passo 11. Utilize o método describe() para obter diversas informações a respeito do DataFrame.

###Describe o que????

In [ ]:
df['age'].describe()

count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64

Exercícios de manipulação de dados - Parte 2

Neste Jupyter notebook você irá resolver uma exercícios utilizando a linguagem Python e a biblioteca Pandas.

Todos os datasets utilizados nos exercícios estão salvos na pasta datasets.

Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

Tarefa 1. Importe o dataset e salve os dados em um dataframe
Os dados estão salvos no arquivo datasets/US_Crime_Rates_1960_2014.csv.

Este dataset contém dados de crimes ocorridos nos Estados Unidos no período de 1960 até 2014.

Salve os dados em uma variável de nome crime.

In [ ]:
url = 'https://raw.githubusercontent.com/awarischool/data-manipulation-exercises/master/datasets/US_Crime_Rates_1960_2014.csv'
crime = pd.read_csv(url)
crime.head()

   Year  Population    Total  ...  Burglary  Larceny_Theft  Vehicle_Theft
0  1960   179323175  3384200  ...    912100        1855400         328200
1  1961   182992000  3488000  ...    949600        1913000         336000
2  1962   185771000  3752200  ...    994300        2089600         366800
3  1963   188483000  4109500  ...   1086400        2297800         408300
4  1964   191141000  4564600  ...   1213200        2514400         472800

[5 rows x 12 columns]


Tarefa 2. Qual o tipo de dados em cada coluna?

In [ ]:
crime.dtypes

Year                  int64
Population            int64
Total                 int64
Violent               int64
Property              int64
Murder                int64
Forcible_Rape         int64
Robbery               int64
Aggravated_assault    int64
Burglary              int64
Larceny_Theft         int64
Vehicle_Theft         int64
dtype: object

Tarefa 3. Converta o tipo de dado da coluna Year para o tipo datetime

Dica: procure na documentação da biblioteca como fazer tal conversão

In [ ]:
crime['Year'] = pd.to_datetime(crime['Year'],format='%Y')
crime.dtypes

Year                  datetime64[ns]
Population                     int64
Total                          int64
Violent                        int64
Property                       int64
Murder                         int64
Forcible_Rape                  int64
Robbery                        int64
Aggravated_assault             int64
Burglary                       int64
Larceny_Theft                  int64
Vehicle_Theft                  int64
dtype: object

Tarefa 4. Configure a coluna Year como index do DataFrame.

Dica: use a função set_index() do Pandas

In [ ]:
crime = crime.set_index('Year')
crime.head()

            Population    Total  ...  Larceny_Theft  Vehicle_Theft
Year                             ...
1960-01-01   179323175  3384200  ...        1855400         328200
1961-01-01   182992000  3488000  ...        1913000         336000
1962-01-01   185771000  3752200  ...        2089600         366800
1963-01-01   188483000  4109500  ...        2297800         408300
1964-01-01   191141000  4564600  ...        2514400         472800

[5 rows x 11 columns]


Tarefa 5. Remova a coluna Total do DataFrame.

In [ ]:
crime.drop(['Total'], axis='columns', inplace=True)
crime.head(20)

            Population  Violent  ...  Larceny_Theft  Vehicle_Theft
Year                             ...
1960-01-01   179323175   288460  ...        1855400         328200
1961-01-01   182992000   289390  ...        1913000         336000
1962-01-01   185771000   301510  ...        2089600         366800
1963-01-01   188483000   316970  ...        2297800         408300
1964-01-01   191141000   364220  ...        2514400         472800
1965-01-01   193526000   387390  ...        2572600         496900
1966-01-01   195576000   430180  ...        2822000         561200
1967-01-01   197457000   499930  ...        3111600         659800
1968-01-01   199399000   595010  ...        3482700         783600
1969-01-01   201385000   661870  ...        3888600         878500
1970-01-01   203235298   738820  ...        4225800         928400
1971-01-01   206212000   816500  ...        4424200         948200
1972-01-01   208230000   834900  ...        4151200         887200
1973-01-01   209851000   875910  ...        4347900         928800
1974-01-01   211392000   974720  ...        5262500         977100
1975-01-01   213124000  1039710  ...        5977700        1009600
1976-01-01   214659000  1004210  ...        6270800         966000
1977-01-01   216332000  1029580  ...        5905700         977700
1978-01-01   218059000  1085550  ...        5991000        1004100
1979-01-01   220099000  1208030  ...        6601000        1112800

[20 rows x 10 columns]


Tarefa 6. Encontre o número de roubos de carro do ano de 1978

In [ ]:
print(f"o número de roubos de carro do ano de 1978 foi {crime.loc['1978-01-01','Vehicle_Theft']}.")

o número de roubos de carro do ano de 1978 foi 1004100.


Tarefa 7. Retorne a linha do ano em que houve o maior número de assasinatos.

Dica: use a coluna Murder como referência.

In [ ]:
crimes = crime.sort_values(['Murder'],ascending=False)
crimes.head(1)

            Population  Violent  ...  Larceny_Theft  Vehicle_Theft
Year                             ...
1991-01-01   252177000  1911770  ...        8142200        1661700

[1 rows x 10 columns]

Tarefa 8. Retorne o número de assassinatos do ano em que foi registrado o menor número de roubo de carros.

In [ ]:
crimess = crime.sort_values(['Vehicle_Theft'])
crimess.head(1)

            Population  Violent  ...  Larceny_Theft  Vehicle_Theft
Year                             ...
1960-01-01   179323175   288460  ...        1855400         328200

[1 rows x 10 columns]

In [ ]:
crimess[['Murder']].head(1)

            Murder
Year
1960-01-01    9110

Exercícios de manipulação de dados - Parte 3

Neste Jupyter notebook você irá resolver uma exercícios utilizando a linguagem Python e a biblioteca Pandas.

Todos os datasets utilizados nos exercícios estão salvos na pasta datasets.

Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

Tarefa 1. Importe o dataset e salve os dados em um dataframe
Os dados estão salvos no arquivo datasets/users_dataset.csv.

Salve os dados em uma variável de nome users.

In [ ]:
url = 'https://raw.githubusercontent.com/awarischool/data-manipulation-exercises/master/datasets/users_dataset.csv'
users = pd.read_csv(url,sep='|')


Tarefa 2. Descubra qual a idade média por ocupação.

Dica: use a função groupby do Pandas na coluna occupation

In [ ]:
occ = users.groupby('occupation').mean()
occ.drop(['user_id'], axis='columns', inplace=True)
occ

                     age
occupation
administrator  38.746835
artist         31.392857
doctor         43.571429
educator       42.010526
engineer       36.388060
entertainment  29.222222
executive      38.718750
healthcare     41.562500
homemaker      32.571429
lawyer         36.750000
librarian      40.000000
marketing      37.615385
none           26.555556
other          34.523810
programmer     33.121212
retired        63.071429
salesman       35.666667
scientist      35.548387
student        22.081633
technician     33.148148
writer         36.311111

Tarefa 3. Para cada ocupação descubra a idade mínima e máxima

In [ ]:
occ_max = users.groupby('occupation').max()
occ_min = users.groupby('occupation').min()
occ_merge = occ_max.merge(occ_min, on=['occupation'], how='left')
occ_merge.drop(["user_id_x","gender_x","zip_code_x","user_id_y","gender_y","zip_code_y"], axis='columns', inplace=True)
occ_merge = occ_merge.rename(columns = {'age_x': 'age_max', 'age_y': 'age_min'}, inplace = False)
occ_merge

               age_max  age_min
occupation
administrator       70       21
artist              48       19
doctor              64       28
educator            63       23
engineer            70       22
entertainment       50       15
executive           69       22
healthcare          62       22
homemaker           50       20
lawyer              53       21
librarian           69       23
marketing           55       24
none                55       11
other               64       13
programmer          63       20
retired             73       51
salesman            66       18
scientist           55       23
student             42        7
technician          55       21
writer              60       18

Tarefa 4. Para cada combinação de ocupação e sexo, calcule a idade média.

In [ ]:
occ = round(users.groupby(['occupation','gender']).mean(),2)
occ.drop(['user_id'], axis='columns', inplace=True)
occ

                        age
occupation    gender
administrator F       40.64
              M       37.16
artist        F       30.31
              M       32.33
doctor        M       43.57
educator      F       39.12
              M       43.10
engineer      F       29.50
              M       36.60
entertainment F       31.00
              M       29.00
executive     F       44.00
              M       38.17
healthcare    F       39.82
              M       45.40
homemaker     F       34.17
              M       23.00
lawyer        F       39.50
              M       36.20
librarian     F       40.00
              M       40.00
marketing     F       37.20
              M       37.88
none          F       36.50
              M       18.60
other         F       35.47
              M       34.03
programmer    F       32.17
              M       33.22
retired       F       70.00
              M       62.54
salesman      F       27.00
              M       38.56
scientist     F       28.33
              M       36.32
student       F       20.75
              M       22.67
technician    F       38.00
              M       32.96
writer        F       37.63
              M       35.35


Tarefa 5. Para cada ocupação calcule a porcentagem de homens e mulheres

In [ ]:
occ_gender = round(100*(users.groupby(['occupation','gender']).count()/users.groupby(['occupation']).count()),2)
occ_gender.drop(['user_id','zip_code','gender'], axis='columns', inplace=True)
occ_gender

                         age
occupation    gender
administrator F        45.57
              M        54.43
artist        F        46.43
              M        53.57
doctor        M       100.00
educator      F        27.37
              M        72.63
engineer      F         2.99
              M        97.01
entertainment F        11.11
              M        88.89
executive     F         9.38
              M        90.62
healthcare    F        68.75
              M        31.25
homemaker     F        85.71
              M        14.29
lawyer        F        16.67
              M        83.33
librarian     F        56.86
              M        43.14
marketing     F        38.46
              M        61.54
none          F        44.44
              M        55.56
other         F        34.29
              M        65.71
programmer    F         9.09
              M        90.91
retired       F         7.14
              M        92.86
salesman      F        25.00
              M        75.00
scientist     F         9.68
              M        90.32
student       F        30.61
              M        69.39
technician    F         3.70
              M        96.30
writer        F        42.22
              M        57.78